import random
from os import system, name
class BGT:
    def __init__(self):
        self.br=0
        self.sk=0
        self.ht=0
    
    def clear(self):
        # for windows
        if name == 'nt':
            _ = system('cls')
    
    def Ans(self, ls, st, ot, inf):
        fl=0
        global mn
        global jok
        global zk
        global j
        global zak
        global pom
        while fl!=1:
            print(str(list.index(i)+1)+". "+st)
            random.shuffle(ls)
            ind=0
            for k in ls:
                ind+=1
                print(f"{ind}) {k}")
                
            while True:
                try:
                    ans=int(input("отговор: "))
                    if ans==1 or ans==2 or ans==3 or ans==4 or ans==50 or ans==66 or ans==100 or ans==0:
                        break
                except ValueError:
                    print("\nвъведете число!\n")
                
            if ans==50:
                if self.br!=1:
                    print("\nжокер '50/50' използван!\n")
                    ls.pop(l.index(ot))
                    ls.pop() 
                    ls.pop()
                    ls.append(ot)
                    self.br=1
                    jok=jok-1
                else:
                    print("\nВече сте използвали жокер '50/50'!\n")
            
            elif ans==66:
                if self.sk!=1:
                    print("\nжокер 'пропускане на въпрос' използван!\n")
                    self.sk=1
                    jok=jok-1
                    fl=1
                else:
                    print("\nВече сте използвали жокер 'пропускане на въпрос'!\n")
            
            elif ans==100:
                if self.ht!=1:
                    print("\nжокер 'помощен текст' използван!\n")
                    print('\n'+inf+'\n')
                    self.ht=1
                    jok=jok-1
                else:
                    print("\nВече сте използвали жокер 'помощен текст'!\n")
            
            elif ans==0:
                while True:
                    otk=input("Отказвате ли се от играта(Д/Н - Y/N)?")
                    if otk=="Н" or otk=="N" or otk=="n" or otk=="н":
                        break

                    elif otk=="Д" or otk=="Y" or otk=="y" or otk=="д":
                        print("\nВие се отказахте от играта!\n")
                        zk=0
                        jok=0
                        return 0
            
            else:
                if ans==(l.index(ot))+1:
                    print("\nTrue!\n"+inf+'\n')
                    fl=1
                    while True:
                        next=input("next?(Д/Н - Y/N - заключи(З,Z)): ")
                        if next=="Н" or next=="N" or next=="n" or next=="н":
                            jok=0
                            j+=1
                            return 0
                        elif next=="Д" or next=="Y" or next=="y" or next=="д":
                            break
                        elif next=="З" or next=="з" or next=="Z" or next=="z":
                            if zk!=1:
                                zak=(list.index(i)+2)*100
                                print(f"\nжокер 'заключена сума' използван!\nвие заключихте сумата от {zak} лева!\n")
                                zk=1
                                jok=jok-1
                                break
                            else:
                                print("\nВече сте използвали жокер 'заключена сума'!\n")

                else:
                    print("\nFalse!\n"+inf)
                    jok=0
                    pom=1
                    return 0

while True:
    bg=BGT()
    bg.clear()
    print("\nИграта съдържа 10 въпроса. За всеки въпрос има няколко възможни отговори, от които само един е верен. Ако бъде избран грешен отговор играта приключва и спечелената сума се дели на две. Играчът има право да се откаже по всяко време(избира 0 като отговор) и така да запази спечелената до тук сума. Играчът има право да заключи една сигурна сума, която при грешно даден отговор, ще се запази. В играта има 3 жокера: '50/50'(за да го използвате напишете 50 като отговор), 'текст'(100) и 'пропускане на въпрос'(66). Максималната възможна сума за спечелване е 1400 лв: по 100 на всеки правилно отговорен въпрос и по 100 за всеки неизползван жокер(+заключена сума)!\n")
    jok=4
    pom=0
    zk=0
    print("\n\nНова игра?\n")   
    strt=input("Д/Н - Y/N:")

    if strt=="Н" or strt=="N" or strt=="n" or strt=="н":
        exit()

    elif strt=="Д" or strt=="Y" or strt=="y" or strt=="д":
        
        list=[]
        j=0
        broy=0
        mn=0
        while len(list)!=10:
            r=random.randint(0,17)
            if r not in list: list.append(r)
        print(list)
        for i in list:
            broy+=1
            if i==0:
                s="В кой град и коя година е създаден българският завод 'РЕСПРОМ'('Битова електроника')?"
                l=["Търново, 1960 г.", "Правец, 1972 г.", "Пловдив, 1962 г.", "Варна, 1968 г."]
                otg="Търново, 1960 г."
                info="Предприятието е създадено през 1960 г. като Завод за малки радиоприемници (ЗМР), а впоследствие – Завод за транзисторни приемници (ЗТР) във Велико Търново. Строителството и изграждането на комплекса се извършват за период около три години. „Старият радиозавод“ се намира в местността „Дервеня“, по пътя от града към село Самоводене. Първоначално постъпилите на работа работници са 34."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j=j+1
                
            if i==1:
                s="Какво произвежда българската фирма 'БАЛКАНТОН'?"
                l=["Грамофони", "Мизукални носители", "Усилватели", "Телевизори"]
                otg="Мизукални носители"
                info="„Балкантон“ е българска звукозаписна компания, създадена под това име в София през 1952 г. Монополист на българския пазар през периода на социалистическото управление на страната от 40-те години на 20 век до 1989 г. Приватизирана през 1999 г. при правителството на ОДС. "
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1

            if i==2:
                s="В заводите на коя българска компания и през коя година, започва производството на радиокасетофон 'ОКТАВА'?"
                l=["Велико Търново, 1960 г.", "Перла, 1960 г.", "Велико Търново, 1975 г.", "Балкантон, 1975 г."]
                otg="Велико Търново, 1975 г."
                info="Октава е популярен български радиокасетофон. Произвежда се от 1975 г. в Завода за радиоприемници Велико Търново. Радиокасетофонът „Октава“ е предназначен за прослушване на радиоразпръсквателни станции в обхвата на ДВ и СВ, а с помощта на вградения касетен магнетофон може да се прослушват записи, да се правят директно записи от вградения радиоприемник и записи от външен източник — микрофон, грамофон, радиоприемник или магнетофон."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1

            if i==3:
                s="Кой е първият български телевизор и от коя година е?"
                l=["Голдстар, 1945 г.", "Велико Търново, 1975 г.", "Орион, 1958 г.", "Опера, 1960 г."]
                otg="Опера, 1960 г."
                info="Първия български телевизор е Опера 1, от 1960 г. Кинескопа е западен АW43-80, в повечето случаи  производство на Тунгсрам. Външно оформлението е силно повлияно от унгарския телевизор Орион 53Т816 – дори несиметричните вентилационни отвори на задния капак са запазени."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
            
            if i==4:
                s="През 1958 г. Елпром, Варна произвежда ПЕА-1. Какво представлява?"
                l=["акумулираща печка","електрическа помпа за автомобил","електрическа антена за покрив","готварска печка"]
                otg="акумулираща печка"
                info="Първата българска акумулираща печка, произведена през 1958 г. в завод Елпром Варна, известна с означението ПЕА-1, което значи ,,печка електрическа акумулираща, 1-ва поред разработка на завода“."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==5:
                s="През 1985 г.в дн. ТУ, София се произвежда първия български компютър, служещ за обучение ЕМК. Какво ознава съкращението?"
                l=["Едноличен малък компютър", "Едноплатков микрокомпютър", "Електро-магнитен компютър", "Евтин малък компютър"]
                otg="Едноплатков микрокомпютър"
                info="Наред с компютрите и периферията за широка употреба – различните серии на Правеците, ИЗОТ-ите и т.н. – обикновено се забравят българските компютри, предназначени за обучение. Едно такова място е Висшият машинно-електротехнически институт ,,Ленин“ (дн. Технически университет София), където през 80-те години в лаборатория ,,Микро­процесори и микрокомпютри“ са проектирани, и изработени поне 15 – 18 Едноплаткови микро-компютри, предназначени за обучение в техникумите и ВУЗ-овете."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==6:
                s="Коя българска фирма, произвеждаща от 20-ти век готварски печки, продължава и до днес?"
                l=["Перла","Беко","Раховец","Зануси"]
                otg="Раховец"
                info="Раховец е българска готварска печка, произвеждана в Горна Оряховица. След кратко прекъсване през 1995 г., раховец отново възстановява производството си."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==7:
                s="Елпром Варна произвежда първият български бойлер ЕБО. През коя година?"
                l=["1968 г.","1964 г.","1958 г.","1960 г."]
                otg="1960 г."
                info="ЕБО е произвеждан от първата половина на 60-те г. в завод Елпром Варна. Той е с обем 200 литра и се нарича ЕБО-200 (от ,,електрически бойлер обикновен“). Използван е за обществени цели -  почивни станции, болници, ресторанти, хотели, а и в селското стопанство."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==8:
                s="През 1965 г. Елпром Варна произвежда 'ЛЪЧ'. Какво представлява?"
                l=["Отоплителна печка","Бойлер","Готварска печка","Друго"]
                otg="Отоплителна печка"
                info="'ЛЪЧ' е най-разпространеният домашен отоплителен уред в последния половин век. Влиза в производство през 1965 г. и е произвеждан в завод Елпром Варна."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==9:
                s="През 70-те години на 20ти век югославското предприятие 'Електронска индустриjа' дава лиценз на българия за производство на пералня 'ПЕРЛА'. В кой завод?"
                l=["Респром, Търново","Елпром, Варна","Правец","Друг"]
                otg="Елпром, Варна"
                info="В началото на 70-те години югославското предприятие 'Електронска индустриjа' - Ниш, което вече произвежда собствени модели автоматични перални 'Перла', дава лиценз за производството им на заводите за електродомакински уреди Татрамат в Попрад, тогавашна Чехословакия, и на българския завод 'Елпром' във Варна."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==10:
                s="През 1965 г. е създаден първия български калкулатор. Кой е той?"
                l=["Елка-1300","Касио","Елка-6521","Шарп"]
                otg="Елка-6521"
                info="Елка е марка български електронни калкулатори и касови апарати. Първият модел на калкулатора – Елка-6521 е създаден през 1965 г. в Института по математика към БАН. Това е първият електронен калкулатор създаден в България."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==11:
                s="Правец 82 е направен по копие на?"
                l=["Apple II","Commodore 64","Друг","Apple I"]
                otg="Apple II"
                info="През 1980 г. в ИТКР е създаден ИМКО-1, първият български персонален компютър. Името на научната разработка на Иван Марангозов идва от Индивидуален МикроКОмпютър. Следва разработката на ИМКО-2, който е преименуван на „Правец-82“ и през 1983 г. започва серийното му производство в Приборостроителния завод в Правец, по-късно разширен и превърнат в Комбинат по микропроцесорна техника – Правец. Правец 82 следва компютърната архитектура на Apple II и двете системи са съвместими."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                
            if i==12:
                s="Какво значи съкращението ИМКО?"
                l=["Индивидуален Микро-компютър","Иван Марангозов копирал оригинала","Индустриален международен конкурс по оптика","Индивидуална машина за копиране"]
                otg="Индивидуален Микро-компютър"
                info="През 1980 г. в ИТКР е създаден ИМКО-1, първият български персонален компютър. Името на научната разработка на Иван Марангозов идва от Индивидуален МикроКОмпютър. "
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                    
            if i==13:
                s="През втората половина на 20-ти век в Пловдив се произвежда първият български електробус ЕЛМОБУС`78. През коя година?"
                l=["1978 г.","1980 г.","1970 г.","1987 г."]
                otg="1978 г."
                info=",,Двата основни проблема на нашето време – енергийната криза и замърсяването на околната среда – възродиха идеята за чистия електрически двигател и накараха специалистите да видят в електромобила оптимален градски транспорт.“ - този текст се разпространява във вестниците още преди половин век. През 1978 г. в Националния преглед на движението ТНТМ на Пловдивския панаир дебютира първият български електробус. Превозното средство използва типичната позната каросерия от микробус Чавдар 5С, но в средата, между емблемата на Балканкар и левия фар, се вижда издигнат многозначителен надпис: ЕЛМОБУС`78. Електробусът е боядисан в бяло и светлочервено."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                    
            if i==14:
                s="През 1964 г. се произвежда електроуред 'Мечта'. Какво представлява той и в кой завод се произвежда?"
                l=["готварска печка, Елпром - Варна","хладилник, Елпром - Варна","телевизор, Респром - Велико Търново","компютър, Правец"]
                otg="готварска печка, Елпром - Варна"
                info="Историята на печки 'Мечта' започва през 1964 или 65 г., а първата Мечта е създадена на основата на печка Чайка. Производител е завод Елпром Варна, а тя има моделен номер 71202. Гаранцията на тази печка е била 1 година, а в действителност още могат да се срещнат такива работещи! За разлика от Чайката, първият модел от новата серия представлява голяма крачка напред, защото има голяма фурна и три нагревателни плочи (котлони) вместо две. По-голяма е и камерата за затопляне на ястия, която се намира под фурната."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                    
            if i==15:
                s="През 1962 г. България произвежда хладилник 'Мраз'. В кой завод?"
                l=["Антон Иванов, София","Елпром, Варна","Респром, Велико Търново","друг"]
                otg="Антон Иванов, София"
                info="Домашният хладилник 'Мраз' е пуснат в производство през 1962 г. от Хладилния завод Антон Иванов, София. Предназначен е за запаз­ване на бързоразвалящи се хранителни продукти при до­машни условия и за добиване в малки коли­чества на бучки чист лед."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                    
            if i==16:
                s="През 1960 г. Елпром, Варна започва производството на електроуред, служещ за загряването на вода в съд, от канче, до големи казани. Кой е този електроуред?"
                l=["Бързовар","Бойлер","Открит котлон","готварска печка"]
                otg="Бързовар"
                info="Производството на този вид бързовари у нас започва около 1960 г. в завод Елпром Варна. Първоначално са изработвани 4 модела – те имат мощност от 600 до 3000 вата и са пускани в две версии – за 150 и 220 волта напрежение."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
                    
            if i==17:
                s="През 1972 г., вероятно в Института по хладилна и климатична техника, е разработен климатик КСА. Какво означава съкращението?"
                l=["автономен стаен климатизатор","автономна климатична система","климатична система за автомобил","климатична система - Казанлък"]
                otg="автономен стаен климатизатор"
                info="Първият български ДОМАШЕН климатик е бил разработен у нас през 1972 г., в Института по хладилна и климатична техника и е произвеждан в Завода за климатична техника ,,Клокотница“ в Димитровград. Нарича се КСА 1.6 (от ,,климатизатор стаен автономен“) и има четири функции – охлаждане, филтриране, частично изсушаване и вентилиране на въздуха. Може да поддържа температура на въздуха в помещението между 21 и 28 градуса. Компресорът и вентилаторът на КСА-то са почти безшумни."
                if bg.Ans(l, s, otg, info)==0:
                    break
                else:
                    j+=1
        if broy==10:
            zk=0
        if zk==0:
            if pom==0:
                mn=(j+jok)*100
            else:
                mn=(j*100)/2
        
        else:
            mn=zak
        print(f"\nвашите верни отговори: {j}")
        print(f"\nВие спечелихте {mn} лева!\n")
        prod=input("\nнатиснете 'enter' за да продължите!\n")